# Working with data frames

In [1]:
import numpy as np
import pandas as pd

## Creation

### Serires

In [2]:
pd.Series(np.arange(4))

0    0
1    1
2    2
3    3
dtype: int64

In [3]:
s = pd.Series(np.arange(4), index=list('ABCD'))
s

A    0
B    1
C    2
D    3
dtype: int64

#### Indexing

In [4]:
s[:2]

A    0
B    1
dtype: int64

In [5]:
s['B':'D']

B    1
C    2
D    3
dtype: int64

### DataFrame

In [6]:
data = np.arange(1,21).reshape(4,-1)
df = pd.DataFrame(data, columns=list('ABCDE'), index=range(1,5))
df

    A   B   C   D   E
1   1   2   3   4   5
2   6   7   8   9  10
3  11  12  13  14  15
4  16  17  18  19  20

#### Indexing

In [7]:
df['A']

1     1
2     6
3    11
4    16
Name: A, dtype: int64

In [8]:
df[['A', 'C']]

    A   C
1   1   3
2   6   8
3  11  13
4  16  18

#### Using the `loc` indexing operator

Note: `loc` works on labels.

In [9]:
df.loc[1:3]

    A   B   C   D   E
1   1   2   3   4   5
2   6   7   8   9  10
3  11  12  13  14  15

In [10]:
df.loc[1:3, 'B':'D']

    B   C   D
1   2   3   4
2   7   8   9
3  12  13  14

#### Using the `iloc` indexing operator

Note: `iloc` works on position indices (like `numpy`)

In [11]:
df.iloc[1:3]

    A   B   C   D   E
2   6   7   8   9  10
3  11  12  13  14  15

In [12]:
df.iloc[1:3, 1:3]

    B   C
2   7   8
3  12  13

## Other ways to get a data frame

### Read from file

In [13]:
%%file data.csv
a,b,c
1,2,3
4,5,6
7,8,9
10,11,12

Overwriting data.csv

In [14]:
df = pd.read_csv('data.csv')
df

    a   b   c
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12

### Read from web

In [15]:
import ssl
ssl._create_default_https_context = ssl._create_unverified_context

There are many tables in the Wikipedia entry for Durham.

In [16]:
dfs = pd.read_html('https://en.wikipedia.org/wiki/Durham,_North_Carolina')

In [17]:
len(dfs)

15

In [18]:
employers = dfs[4]

In [19]:
employers.head()

                                     Employer  No. of employees
0  Duke University & Duke Univ. Health System             34863
1                                         IBM             10000
2                       Durham Public Schools              4600
3                             GlaxoSmithKline              3700
4              Blue Cross & Blue Shield of NC              3200

## Data manipulation

In [20]:
url = 'https://rb.gy/u5avn'

In [21]:
df = pd.read_csv(url, index_col=0)

### Select rows

In [22]:
df.head(3)

,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
#,,,,,,,,,,,,
1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False

In [23]:
df.tail(3)

,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
#,,,,,,,,,,,,
720,HoopaHoopa Confined,Psychic,Ghost,600,80,110,60,150,130,70,6,True
720,HoopaHoopa Unbound,Psychic,Dark,680,80,160,60,170,130,80,6,True
721,Volcanion,Fire,Water,600,80,110,120,130,90,70,6,True

In [24]:
df.sample(3)

,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
#,,,,,,,,,,,,
526,Gigalith,Rock,NaN,515,85,135,130,60,80,25,5,False
487,GiratinaOrigin Forme,Ghost,Dragon,680,150,120,100,120,100,90,4,True
444,Gabite,Dragon,Ground,410,68,90,65,50,55,82,4,False

In [25]:
df.iloc[0]

Name          Bulbasaur
Type 1            Grass
Type 2           Poison
Total               318
HP                   45
Attack               49
Defense              49
Sp. Atk              65
Sp. Def              65
Speed                45
Generation            1
Legendary         False
Name: 1, dtype: object

In [26]:
df[1:3]

,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
#,,,,,,,,,,,,
2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False

In [27]:
df.loc[1:3]

,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
#,,,,,,,,,,,,
1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False

#### Chaining operations

In [28]:
df.head(5).tail(3)

,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
#,,,,,,,,,,,,
3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

### Select rows using conditions

In [29]:
df.Name

#
1                  Bulbasaur
2                    Ivysaur
3                   Venusaur
3      VenusaurMega Venusaur
4                 Charmander
               ...
719                  Diancie
719      DiancieMega Diancie
720      HoopaHoopa Confined
720       HoopaHoopa Unbound
721                Volcanion
Name: Name, Length: 800, dtype: object

In [30]:
df.Name.str.startswith('V')

#
1      False
2      False
3       True
3       True
4      False
       ...
719    False
719    False
720    False
720    False
721     True
Name: Name, Length: 800, dtype: bool

In [31]:
df.loc[df.Name.str.startswith('V')].head()

,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
#,,,,,,,,,,,,
3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
37,Vulpix,Fire,NaN,299,38,41,40,50,65,65,1,False
45,Vileplume,Grass,Poison,490,75,80,85,110,90,50,1,False
48,Venonat,Bug,Poison,305,60,55,50,40,55,45,1,False

In [32]:
df.loc[(df.Name.str.startswith('V')) & (df.HP > 90)].head()

,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
#,,,,,,,,,,,,
134,Vaporeon,Water,NaN,525,130,65,60,110,95,65,1,False
494,Victini,Psychic,Fire,600,100,100,100,100,100,100,5,True
640,Virizion,Grass,Fighting,580,91,90,72,90,129,108,5,True

In [33]:
df.query('Attack >= 100 and Defense >= 100').head()

,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
#,,,,,,,,,,,,
3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
6,CharizardMega Charizard X,Fire,Dragon,634,78,130,111,130,85,100,1,False
9,BlastoiseMega Blastoise,Water,NaN,630,79,103,120,135,115,78,1,False
28,Sandslash,Ground,NaN,450,75,100,110,45,55,65,1,False
76,Golem,Rock,Ground,495,80,120,130,55,65,45,1,False

In [34]:
df.query('Attack > 100 and Attack > Defense').head()

,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
#,,,,,,,,,,,,
6,CharizardMega Charizard X,Fire,Dragon,634,78,130,111,130,85,100,1,False
6,CharizardMega Charizard Y,Fire,Flying,634,78,104,78,159,115,100,1,False
15,BeedrillMega Beedrill,Bug,Poison,495,65,150,40,15,80,145,1,False
34,Nidoking,Poison,Ground,505,81,102,77,85,75,85,1,False
57,Primeape,Fighting,NaN,455,65,105,60,60,70,95,1,False

### Select columns

In [35]:
df.columns

Index(['Name', 'Type 1', 'Type 2', 'Total', 'HP', 'Attack', 'Defense',
       'Sp. Atk', 'Sp. Def', 'Speed', 'Generation', 'Legendary'],
      dtype='object')

In [36]:
df.index

Int64Index([  1,   2,   3,   3,   4,   5,   6,   6,   6,   7,
            ...
            714, 715, 716, 717, 718, 719, 719, 720, 720, 721],
           dtype='int64', name='#', length=800)

In [37]:
target_cols = ['Type 1', 'Type 2', 'Total']
df[target_cols].head()

  Type 1  Type 2  Total
#
1  Grass  Poison    318
2  Grass  Poison    405
3  Grass  Poison    525
3  Grass  Poison    625
4   Fire     NaN    309

In [38]:
target_cols = df.columns.str.startswith('T')
df.iloc[:3, target_cols]

  Type 1  Type 2  Total
#
1  Grass  Poison    318
2  Grass  Poison    405
3  Grass  Poison    525

In [39]:
target_cols = df.columns.str.contains('sp', case=False)
df.iloc[:3, target_cols]

   Sp. Atk  Sp. Def  Speed
#
1       65       65     45
2       80       80     60
3      100      100     80

In [40]:
df.select_dtypes('object').head(3)

        Name Type 1  Type 2
#
1  Bulbasaur  Grass  Poison
2    Ivysaur  Grass  Poison
3   Venusaur  Grass  Poison

In [41]:
df.select_dtypes('number').head(3)

   Total  HP  Attack  Defense  Sp. Atk  Sp. Def  Speed  Generation
#
1    318  45      49       49       65       65     45           1
2    405  60      62       63       80       80     60           1
3    525  80      82       83      100      100     80           1

In [42]:
df.select_dtypes('bool').head(3)

   Legendary
#
1      False
2      False
3      False

### Sort rows

In [43]:
df.sort_values('Speed').head(3)

,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
#,,,,,,,,,,,,
446,Munchlax,Normal,NaN,390,135,85,40,40,85,5,4,False
213,Shuckle,Bug,Rock,505,20,10,230,10,230,5,2,False
597,Ferroseed,Grass,Steel,305,44,50,91,24,86,10,5,False

In [44]:
df.sort_values('Speed', ascending=False).head(3)

,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
#,,,,,,,,,,,,
386,DeoxysSpeed Forme,Psychic,NaN,600,50,95,90,95,90,180,3,True
291,Ninjask,Bug,Flying,456,61,90,45,50,50,160,3,False
386,DeoxysNormal Forme,Psychic,NaN,600,50,150,50,150,50,150,3,True

In [45]:
df.sort_values(['Attack', 'Speed'], ascending=[True, False]).head(3)

,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
#,,,,,,,,,,,,
113,Chansey,Normal,NaN,450,250,5,5,35,105,50,1,False
440,Happiny,Normal,NaN,220,100,5,5,15,65,30,4,False
129,Magikarp,Water,NaN,200,20,10,55,15,20,80,1,False

### Create new columns

In [46]:
df['Aggressivenes'] = df['Attack'] - df['Defense']
df.head(3)

,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary,Aggressivenes
#,,,,,,,,,,,,,
1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False,0
2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False,-1
3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False,-1

### Rearrange columns

In [47]:
cols = list(df.columns[-1:]) + list(df.columns[:-1])
df = df[cols]
df.head(3)

,Aggressivenes,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
#,,,,,,,,,,,,,
1,0,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
2,-1,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
3,-1,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False

### Drop columns

In [48]:
df = df.drop('Aggressivenes', axis=1)

In [49]:
df.head(3)

,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
#,,,,,,,,,,,,
1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False

### Drop duplicate rows

In [50]:
df.drop_duplicates(['Type 1', 'Type 2']).head(3)

,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
#,,,,,,,,,,,,
1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False
6,Charizard,Fire,Flying,534,78,84,78,109,85,100,1,False

### Drop rows with missing data

In [51]:
df.dropna(subset=['Type 1', 'Type 2'], how='any').drop_duplicates(['Type 1', 'Type 2']).head(3)

,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
#,,,,,,,,,,,,
1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
6,Charizard,Fire,Flying,534,78,84,78,109,85,100,1,False
6,CharizardMega Charizard X,Fire,Dragon,634,78,130,111,130,85,100,1,False

Use parenthesis to break into multiple lines for readability

In [52]:
(
    df
    .dropna(subset=['Type 1', 'Type 2'], how='any')
    .drop_duplicates(['Type 1', 'Type 2'])
    .head(3)
)

,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
#,,,,,,,,,,,,
1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
6,Charizard,Fire,Flying,534,78,84,78,109,85,100,1,False
6,CharizardMega Charizard X,Fire,Dragon,634,78,130,111,130,85,100,1,False

### Summary

In [53]:
df.dtypes

Name          object
Type 1        object
Type 2        object
Total          int64
HP             int64
Attack         int64
Defense        int64
Sp. Atk        int64
Sp. Def        int64
Speed          int64
Generation     int64
Legendary       bool
dtype: object

In [54]:
df.describe()

,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation
count,800.00000,800.000000,800.000000,800.000000,800.000000,800.000000,800.000000,800.00000
mean,435.10250,69.258750,79.001250,73.842500,72.820000,71.902500,68.277500,3.32375
std,119.96304,25.534669,32.457366,31.183501,32.722294,27.828916,29.060474,1.66129
min,180.00000,1.000000,5.000000,5.000000,10.000000,20.000000,5.000000,1.00000
25%,330.00000,50.000000,55.000000,50.000000,49.750000,50.000000,45.000000,2.00000
50%,450.00000,65.000000,75.000000,70.000000,65.000000,70.000000,65.000000,3.00000
75%,515.00000,80.000000,100.000000,90.000000,95.000000,90.000000,90.000000,5.00000
max,780.00000,255.000000,190.000000,230.000000,194.000000,230.000000,180.000000,6.00000

In [55]:
df.sum(numeric_only=True)

Total         348082
HP             55407
Attack         63201
Defense        59074
Sp. Atk        58256
Sp. Def        57522
Speed          54622
Generation      2659
Legendary         65
dtype: int64

In [56]:
df.select_dtypes('number').agg(['mean', 'min', 'max'])

,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation
mean,435.1025,69.25875,79.00125,73.8425,72.82,71.9025,68.2775,3.32375
min,180.0000,1.00000,5.00000,5.0000,10.00,20.0000,5.0000,1.00000
max,780.0000,255.00000,190.00000,230.0000,194.00,230.0000,180.0000,6.00000

### Grouping

In [57]:
s1 = df.groupby('Type 1').agg({
    'Attack': 'median',
    'Defense': ['min', 'max'],
})
s1.head(3)

       Attack Defense
       median     min  max
Type 1
Bug      65.0      30  230
Dark     88.0      30  125
Dragon  113.5      35  130

In [58]:
s2 = s1.reset_index()
s2.columns = s2.columns.to_flat_index()
s2.head(3)

  (Type 1, )  (Attack, median)  (Defense, min)  (Defense, max)
0        Bug              65.0              30             230
1       Dark              88.0              30             125
2     Dragon             113.5              35             130

In [59]:
def my_median(x):
    return np.quantile(x, 0.5)

In [60]:
s3 = (
    df
    .drop(['Name', 'Legendary'], axis=1)
    .groupby(['Type 1', 'Type 2'])
    .agg(my_median)
)
s3.head(3)

                 Total    HP  Attack  Defense  Sp. Atk  Sp. Def  Speed  \
Type 1 Type 2
Bug    Electric  395.5  60.0    62.0     55.0     77.0     55.0   86.5
       Fighting  550.0  80.0   155.0     95.0     40.0    100.0   80.0
       Fire      455.0  70.0    72.5     60.0     92.5     80.0   80.0

                 Generation
Type 1 Type 2
Bug    Electric         5.0
       Fighting         2.0
       Fire             5.0

In [61]:
s3.reset_index().sample(3)

,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation
5,Bug,Grass,392.5,57.5,66.5,80.0,55.0,80.0,39.0,4.5
51,Ghost,Dark,485.0,50.0,92.0,108.0,92.0,108.0,35.0,4.0
64,Grass,Poison,400.0,60.0,70.0,63.0,85.0,75.0,55.0,1.0

## Combining DataFrames

Run `pip install faker` in terminal first to install package.

In [62]:
from faker import Faker
fake = Faker()
fake.seed_instance(1234)

#### Combine DataFrames with same strcuture

In [63]:
cols = ['ssn', 'name', 'email', 'country', 'state', 'county', 'age', 'sex']
data = []
for i in range(10):
    age = np.random.choice(range(18, 100))
    sex = np.random.choice(['M', 'F'])
    person = [fake.ssn(), fake.name(), fake.email(), fake.country(), fake.state(), fake.job(), age, sex]
    data.append(person)
df_employee1 = pd.DataFrame(data, columns=cols)
df_employee1

,ssn,name,email,country,state,county,age,sex
0,797-57-1915,Thomas Crosby,powerschristopher@example.com,Dominica,Alaska,Airline pilot,71,M
1,808-03-5671,Kari Ford,whitedanny@example.org,Macao,New York,Fisheries officer,86,M
2,067-86-8866,Andrea Leonard,adamsangela@example.net,Gabon,New Mexico,Marine scientist,52,F
3,273-32-3278,Joseph Smith,smithdouglas@example.com,Palestinian Territory,Missouri,Diplomatic Services operational officer,51,M
4,056-10-9627,Bernard Lewis Jr.,kelli82@example.net,Gambia,New Jersey,Archaeologist,24,F
5,427-36-0659,Christopher Blevins,kimberlymarshall@example.net,Hungary,Wisconsin,Magazine journalist,47,M
6,508-44-9550,Karen Patton,mberg@example.org,Kazakhstan,Washington,"Scientist, physiological",23,M
7,835-57-4845,Richard Butler,crosbydakota@example.com,Honduras,Texas,Freight forwarder,47,M
8,657-25-5659,Michael Richmond,teresa57@example.net,Barbados,Colorado,Nutritional therapist,33,F
9,220-07-4689,Colleen Gallegos,kevin71@example.net,Equatorial Guinea,California,Physiological scientist,47,F

In [64]:
cols = ['ssn',  'email', 'name', 'country', 'state', 'county', 'age', 'sex']
data = []
for i in range(10):
    age = np.random.choice(range(18, 100))
    sex = np.random.choice(['M', 'F'])
    person = [fake.ssn(), fake.email(), fake.name(), fake.country(), fake.state(), fake.job(), age, sex]
    data.append(person)
df_employee2 = pd.DataFrame(data, columns=cols)
df_employee2

,ssn,email,name,country,state,county,age,sex
0,207-13-6499,janetclay@example.net,Robert Galvan,Costa Rica,North Carolina,"Pharmacist, community",32,M
1,179-75-3331,bruce58@example.org,Dr. Joshua Cook Jr.,Nigeria,Hawaii,Dance movement psychotherapist,75,M
2,863-70-1143,george01@example.org,Amanda Myers,Greece,Indiana,Museum/gallery curator,81,M
3,896-36-8807,robert92@example.net,David Jenkins,Togo,Oregon,Health and safety inspector,66,M
4,539-15-6150,jason96@example.org,Ruben Hall,Liechtenstein,Hawaii,Museum/gallery conservator,48,M
5,316-01-1202,bfoster@example.net,Charlene Fuller,Cayman Islands,Maine,"Therapist, art",39,M
6,379-84-9839,jamie89@example.com,Kara Johnson,South Africa,Washington,Psychotherapist,37,F
7,677-14-0441,tanya71@example.org,Stephanie Rivera,Guernsey,Wisconsin,Horticultural consultant,67,F
8,306-88-9553,anna49@example.org,Nicole Jones,Puerto Rico,Rhode Island,"Engineer, electronics",57,M
9,348-66-5477,stephen18@example.net,Barbara Sanchez,Holy See (Vatican City State),Florida,Air cabin crew,93,M

See what happens to name and email columns.

In [65]:
df_employees = pd.concat([df_employee1, df_employee2])

In [66]:
df_employees

,ssn,name,email,country,state,county,age,sex
0,797-57-1915,Thomas Crosby,powerschristopher@example.com,Dominica,Alaska,Airline pilot,71,M
1,808-03-5671,Kari Ford,whitedanny@example.org,Macao,New York,Fisheries officer,86,M
2,067-86-8866,Andrea Leonard,adamsangela@example.net,Gabon,New Mexico,Marine scientist,52,F
3,273-32-3278,Joseph Smith,smithdouglas@example.com,Palestinian Territory,Missouri,Diplomatic Services operational officer,51,M
4,056-10-9627,Bernard Lewis Jr.,kelli82@example.net,Gambia,New Jersey,Archaeologist,24,F
5,427-36-0659,Christopher Blevins,kimberlymarshall@example.net,Hungary,Wisconsin,Magazine journalist,47,M
6,508-44-9550,Karen Patton,mberg@example.org,Kazakhstan,Washington,"Scientist, physiological",23,M
7,835-57-4845,Richard Butler,crosbydakota@example.com,Honduras,Texas,Freight forwarder,47,M
8,657-25-5659,Michael Richmond,teresa57@example.net,Barbados,Colorado,Nutritional therapist,33,F
9,220-07-4689,Colleen Gallegos,kevin71@example.net,Equatorial Guinea,California,Physiological scientist,47,F
0,207-13-6499,Robert Galvan,janetclay@example.net,Costa Rica,North Carolina,"Pharmacist, community",32,M
1,179-75-3331,Dr. Joshua Cook Jr.,bruce58@example.org,Nigeria,Hawaii,Dance movement psychotherapist,75,M
2,863-70-1143,Amanda Myers,george01@example.org,Greece,Indiana,Museum/gallery curator,81,M
3,896-36-8807,David Jenkins,robert92@example.net,Togo,Oregon,Health and safety inspector,66,M
4,539-15-6150,Ruben Hall,jason96@example.org,Liechtenstein,Hawaii,Museum/gallery conservator,48,M
5,316-01-1202,Charlene Fuller,bfoster@example.net,Cayman Islands,Maine,"Therapist, art",39,M
6,379-84-9839,Kara Johnson,jamie89@example.com,South Africa,Washington,Psychotherapist,37,F
7,677-14-0441,Stephanie Rivera,tanya71@example.org,Guernsey,Wisconsin,Horticultural consultant,67,F
8,306-88-9553,Nicole Jones,anna49@example.org,Puerto Rico,Rhode Island,"Engineer, electronics",57,M
9,348-66-5477,Barbara Sanchez,stephen18@example.net,Holy See (Vatican City State),Florida,Air cabin crew,93,M

You can reset the row labels if you want them to be unique.

In [67]:
df_employees.reset_index(drop=True)

,ssn,name,email,country,state,county,age,sex
0,797-57-1915,Thomas Crosby,powerschristopher@example.com,Dominica,Alaska,Airline pilot,71,M
1,808-03-5671,Kari Ford,whitedanny@example.org,Macao,New York,Fisheries officer,86,M
2,067-86-8866,Andrea Leonard,adamsangela@example.net,Gabon,New Mexico,Marine scientist,52,F
3,273-32-3278,Joseph Smith,smithdouglas@example.com,Palestinian Territory,Missouri,Diplomatic Services operational officer,51,M
4,056-10-9627,Bernard Lewis Jr.,kelli82@example.net,Gambia,New Jersey,Archaeologist,24,F
5,427-36-0659,Christopher Blevins,kimberlymarshall@example.net,Hungary,Wisconsin,Magazine journalist,47,M
6,508-44-9550,Karen Patton,mberg@example.org,Kazakhstan,Washington,"Scientist, physiological",23,M
7,835-57-4845,Richard Butler,crosbydakota@example.com,Honduras,Texas,Freight forwarder,47,M
8,657-25-5659,Michael Richmond,teresa57@example.net,Barbados,Colorado,Nutritional therapist,33,F
9,220-07-4689,Colleen Gallegos,kevin71@example.net,Equatorial Guinea,California,Physiological scientist,47,F
10,207-13-6499,Robert Galvan,janetclay@example.net,Costa Rica,North Carolina,"Pharmacist, community",32,M
11,179-75-3331,Dr. Joshua Cook Jr.,bruce58@example.org,Nigeria,Hawaii,Dance movement psychotherapist,75,M
12,863-70-1143,Amanda Myers,george01@example.org,Greece,Indiana,Museum/gallery curator,81,M
13,896-36-8807,David Jenkins,robert92@example.net,Togo,Oregon,Health and safety inspector,66,M
14,539-15-6150,Ruben Hall,jason96@example.org,Liechtenstein,Hawaii,Museum/gallery conservator,48,M
15,316-01-1202,Charlene Fuller,bfoster@example.net,Cayman Islands,Maine,"Therapist, art",39,M
16,379-84-9839,Kara Johnson,jamie89@example.com,South Africa,Washington,Psychotherapist,37,F
17,677-14-0441,Stephanie Rivera,tanya71@example.org,Guernsey,Wisconsin,Horticultural consultant,67,F
18,306-88-9553,Nicole Jones,anna49@example.org,Puerto Rico,Rhode Island,"Engineer, electronics",57,M
19,348-66-5477,Barbara Sanchez,stephen18@example.net,Holy See (Vatican City State),Florida,Air cabin crew,93,M

#### Merging differnt information

In [68]:
cols = ['ssn', 'wt', 'ht', 'rhr']
ssns = df_employees.ssn.tolist() + [fake.ssn() for i in range(10)]
n = 10
ssn_sample = np.random.choice(ssns, n, replace=False)
wt = np.random.randint(45, 200, n)
ht = np.random.randint(140, 200, n)
rhr = np.random.randint(40, 120, n)
df_fitness = pd.DataFrame(dict(ssn = ssn_sample, weight = wt, height = ht, hr = rhr))

In [69]:
df_fitness

           ssn  weight  height   hr
0  445-66-1131      67     173   69
1  405-05-0723      58     171   84
2  835-57-4845      66     183  108
3  220-07-4689     136     172  110
4  321-67-5824      54     161   87
5  179-75-3331     117     165   61
6  427-36-0659      59     175   72
7  594-29-5698     126     152   89
8  273-32-3278     110     195   86
9  268-90-7956      68     160   89

When row can be uniquely identified by one or more columns

In [70]:
df_employees.merge(df_fitness, on='ssn')

,ssn,name,email,country,state,county,age,sex,weight,height,hr
0,273-32-3278,Joseph Smith,smithdouglas@example.com,Palestinian Territory,Missouri,Diplomatic Services operational officer,51,M,110,195,86
1,427-36-0659,Christopher Blevins,kimberlymarshall@example.net,Hungary,Wisconsin,Magazine journalist,47,M,59,175,72
2,835-57-4845,Richard Butler,crosbydakota@example.com,Honduras,Texas,Freight forwarder,47,M,66,183,108
3,220-07-4689,Colleen Gallegos,kevin71@example.net,Equatorial Guinea,California,Physiological scientist,47,F,136,172,110
4,179-75-3331,Dr. Joshua Cook Jr.,bruce58@example.org,Nigeria,Hawaii,Dance movement psychotherapist,75,M,117,165,61

In [71]:
df_employees.merge(df_fitness, on='ssn', how='left')

,ssn,name,email,country,state,county,age,sex,weight,height,hr
0,797-57-1915,Thomas Crosby,powerschristopher@example.com,Dominica,Alaska,Airline pilot,71,M,NaN,NaN,NaN
1,808-03-5671,Kari Ford,whitedanny@example.org,Macao,New York,Fisheries officer,86,M,NaN,NaN,NaN
2,067-86-8866,Andrea Leonard,adamsangela@example.net,Gabon,New Mexico,Marine scientist,52,F,NaN,NaN,NaN
3,273-32-3278,Joseph Smith,smithdouglas@example.com,Palestinian Territory,Missouri,Diplomatic Services operational officer,51,M,110.0,195.0,86.0
4,056-10-9627,Bernard Lewis Jr.,kelli82@example.net,Gambia,New Jersey,Archaeologist,24,F,NaN,NaN,NaN
5,427-36-0659,Christopher Blevins,kimberlymarshall@example.net,Hungary,Wisconsin,Magazine journalist,47,M,59.0,175.0,72.0
6,508-44-9550,Karen Patton,mberg@example.org,Kazakhstan,Washington,"Scientist, physiological",23,M,NaN,NaN,NaN
7,835-57-4845,Richard Butler,crosbydakota@example.com,Honduras,Texas,Freight forwarder,47,M,66.0,183.0,108.0
8,657-25-5659,Michael Richmond,teresa57@example.net,Barbados,Colorado,Nutritional therapist,33,F,NaN,NaN,NaN
9,220-07-4689,Colleen Gallegos,kevin71@example.net,Equatorial Guinea,California,Physiological scientist,47,F,136.0,172.0,110.0
10,207-13-6499,Robert Galvan,janetclay@example.net,Costa Rica,North Carolina,"Pharmacist, community",32,M,NaN,NaN,NaN
11,179-75-3331,Dr. Joshua Cook Jr.,bruce58@example.org,Nigeria,Hawaii,Dance movement psychotherapist,75,M,117.0,165.0,61.0
12,863-70-1143,Amanda Myers,george01@example.org,Greece,Indiana,Museum/gallery curator,81,M,NaN,NaN,NaN
13,896-36-8807,David Jenkins,robert92@example.net,Togo,Oregon,Health and safety inspector,66,M,NaN,NaN,NaN
14,539-15-6150,Ruben Hall,jason96@example.org,Liechtenstein,Hawaii,Museum/gallery conservator,48,M,NaN,NaN,NaN
15,316-01-1202,Charlene Fuller,bfoster@example.net,Cayman Islands,Maine,"Therapist, art",39,M,NaN,NaN,NaN
16,379-84-9839,Kara Johnson,jamie89@example.com,South Africa,Washington,Psychotherapist,37,F,NaN,NaN,NaN
17,677-14-0441,Stephanie Rivera,tanya71@example.org,Guernsey,Wisconsin,Horticultural consultant,67,F,NaN,NaN,NaN
18,306-88-9553,Nicole Jones,anna49@example.org,Puerto Rico,Rhode Island,"Engineer, electronics",57,M,NaN,NaN,NaN
19,348-66-5477,Barbara Sanchez,stephen18@example.net,Holy See (Vatican City State),Florida,Air cabin crew,93,M,NaN,NaN,NaN

In [72]:
df_employees.merge(df_fitness, on='ssn', how='right')

,ssn,name,email,country,state,county,age,sex,weight,height,hr
0,445-66-1131,NaN,NaN,NaN,NaN,NaN,NaN,NaN,67,173,69
1,405-05-0723,NaN,NaN,NaN,NaN,NaN,NaN,NaN,58,171,84
2,835-57-4845,Richard Butler,crosbydakota@example.com,Honduras,Texas,Freight forwarder,47.0,M,66,183,108
3,220-07-4689,Colleen Gallegos,kevin71@example.net,Equatorial Guinea,California,Physiological scientist,47.0,F,136,172,110
4,321-67-5824,NaN,NaN,NaN,NaN,NaN,NaN,NaN,54,161,87
5,179-75-3331,Dr. Joshua Cook Jr.,bruce58@example.org,Nigeria,Hawaii,Dance movement psychotherapist,75.0,M,117,165,61
6,427-36-0659,Christopher Blevins,kimberlymarshall@example.net,Hungary,Wisconsin,Magazine journalist,47.0,M,59,175,72
7,594-29-5698,NaN,NaN,NaN,NaN,NaN,NaN,NaN,126,152,89
8,273-32-3278,Joseph Smith,smithdouglas@example.com,Palestinian Territory,Missouri,Diplomatic Services operational officer,51.0,M,110,195,86
9,268-90-7956,NaN,NaN,NaN,NaN,NaN,NaN,NaN,68,160,89

The default is to match on *all* common columns.

In [73]:
df_employees.merge(df_fitness)

,ssn,name,email,country,state,county,age,sex,weight,height,hr
0,273-32-3278,Joseph Smith,smithdouglas@example.com,Palestinian Territory,Missouri,Diplomatic Services operational officer,51,M,110,195,86
1,427-36-0659,Christopher Blevins,kimberlymarshall@example.net,Hungary,Wisconsin,Magazine journalist,47,M,59,175,72
2,835-57-4845,Richard Butler,crosbydakota@example.com,Honduras,Texas,Freight forwarder,47,M,66,183,108
3,220-07-4689,Colleen Gallegos,kevin71@example.net,Equatorial Guinea,California,Physiological scientist,47,F,136,172,110
4,179-75-3331,Dr. Joshua Cook Jr.,bruce58@example.org,Nigeria,Hawaii,Dance movement psychotherapist,75,M,117,165,61

When the dataframes share the same index (row labels)

In [74]:
df_employees_new = df_employees.set_index('ssn', drop=True)
df_employees_new.head()

,name,email,country,state,county,age,sex
ssn,,,,,,,
797-57-1915,Thomas Crosby,powerschristopher@example.com,Dominica,Alaska,Airline pilot,71,M
808-03-5671,Kari Ford,whitedanny@example.org,Macao,New York,Fisheries officer,86,M
067-86-8866,Andrea Leonard,adamsangela@example.net,Gabon,New Mexico,Marine scientist,52,F
273-32-3278,Joseph Smith,smithdouglas@example.com,Palestinian Territory,Missouri,Diplomatic Services operational officer,51,M
056-10-9627,Bernard Lewis Jr.,kelli82@example.net,Gambia,New Jersey,Archaeologist,24,F

In [75]:
df_fitness_new = df_fitness.set_index('ssn', drop=True)

With the `join` method, you can join multiple DataFrames at the same time. The default is a left join.

In [76]:
df_employees_new.join([df_fitness_new], how='inner')

,name,email,country,state,county,age,sex,weight,height,hr
ssn,,,,,,,,,,
273-32-3278,Joseph Smith,smithdouglas@example.com,Palestinian Territory,Missouri,Diplomatic Services operational officer,51,M,110,195,86
427-36-0659,Christopher Blevins,kimberlymarshall@example.net,Hungary,Wisconsin,Magazine journalist,47,M,59,175,72
835-57-4845,Richard Butler,crosbydakota@example.com,Honduras,Texas,Freight forwarder,47,M,66,183,108
220-07-4689,Colleen Gallegos,kevin71@example.net,Equatorial Guinea,California,Physiological scientist,47,F,136,172,110
179-75-3331,Dr. Joshua Cook Jr.,bruce58@example.org,Nigeria,Hawaii,Dance movement psychotherapist,75,M,117,165,61